---
kind: property
id: P:Autodesk.Revit.UI.ExternalCommandData.View
zh: 视图
source: html/8d65bc91-e3a2-7836-03b5-f48c9a150831.htm
---
# Autodesk.Revit.UI.ExternalCommandData.View Property

**中文**: 视图

Retrieves an object that represents the View external command work on.

## Syntax (C#)
```csharp
public View View { get; set; }
```